{
    "Dashboard": "Dashboard",
    "Charts": "Charts",
    "Tables": "Tables",
    "Forms": "Forms",
    "Bootstrap Element": "Bootstrap Element",
    "Bootstrap Grid": "Bootstrap Grid",
    "Component": "Component",
    "Menu": "Menu",
    "Submenu": "Submenu",
    "Blank Page": "Blank Page",
    "More Theme": "More Themes",
    "Download Now": "Download Now",
    "Language": "Language",
    "English": "English",
    "French": "French",
    "Urdu": "Urdu",
    "Spanish": "Spanish",
    "Italian": "Italian",
    "Farsi": "Farsi",
    "German": "German",
    "Simplified Chinese": "Simplified Chinese",
    "Search": "Search",
    "Settings": "Settings",
    "Profile": "Profile",
    "Inbox": "Inbox",
    "Log Out": "Log Out",
    "Pending Task": "Pending Task",
    "In queue": "In queue",
    "Mail": "Mail",
    "View All": "View All",
    "More Themes": "More Themes",
    "Collapse Sidebar": "Collapse Sidebar",
    "Full Name": "Full Name",
    "Email": "Email",
    "Password": "Password",
    "Repeat Password": "Repeat Password",
    "Register": "Register",
    "Log in": "Log in",
    "NO_APPS_FOR_CREATING_TOPIC": "Unfortunately, you do not yet have administrative rights for at least one application. Please request such rights on the \"My Applications\" page first.",
    "SUBSCRIBE_INFO_TEXT": "You can subscribe to this topic with one (or more) of your applications. This will grant read access (or write access, for COMMAND topics) to your application's API Key for the currently selected Kafka Environment.",
    "NO_APPS_FOR_SUBSCRIPTION": "Currently, no (more) applications are available for subscribing to this topic. Make sure that you have Application Owner rights for your application. Note that the owning application cannot subscribe to its own topic (it already has required rights).",
    "TOPIC_NOT_EXISTING_ON_ENVIRONMENT": "There exists no topic with this name on the current environment ({{ environmentName }}). Choose another environment in the top bar.",
    "DELETE_TOPIC_TEXT": "You can delete the topic here. Internal topics must be deleted on development environments, and the deletion must be staged to following environments. API topics can only be deleted if they have not been staged to a succeeding environment (otherwise, delete them there first).",
    "DEPRECATE_TOPIC_HTML": "Here you can mark this Topic as \"deprecated\". This tells other teams that this topic should no longer be used or that this topic will soon not be available for use. Ideally, you mention in the description text which topic can be used instead. Also select a date until when the topic will at least be made available - this date must be at least {{period}} in the future. <br><br>Subscribers to this topic will be informed of the \"deprecation\" by email. ",
    "DEPRECATE_ALL_STAGES_ALERT_HTML": "The topic will be marked as deprecated on <b>all</b> stages <b>immediately!</b>",
    "Deprecate Topic Label": "Mark Topic as deprecated",
    "PICK_DEPRECATE_DATE": "Deprecation date",
    "UNMARK_DEPRECATION": "Undeprecate",
    "Usable until": "Usable until",
    "Description Deprecation": "Deprecation reference text",
    "Delete Schema": "Delete schema version",
    "DELETE_SCHEMA_DIALOG_QUESTION_TEXT": "Really delete this schema version? This cannot be undone. You will have to upload the schema again to restore this version.",
    "STAGING_TEXT": "Select one of your applications for which you want to copy the performed changes from this environment to the target environment. In the next step, the changes will be displayed.",
    "NO_CHANGES_FOR_STAGING": "There are no changes for this application on this environment, compared to the target environment.",
    "TOPIC_STAGING_ONLY_ENVIRONMENT": "On this environment, you cannot create topics directly. Please create your topic on a preceding environment and use Staging to apply your changes to this environment.",
    "APPLY_CHANGES_TO": "Apply changes to {{environmentName}}",
    "NO_SCHEMA_FOR_TOPIC": "No schema has been published for this topic yet. Please contact the team of the owning application to have them publish a schema.",
    "EDIT_SCHEMA_DESCRIPTION": "Enter or paste here the new JSON Schema for this topic. Please note that the schema must be compatible to the previous schema (if any). Depending on the type of the topic, different compatibility rules apply.",
    "EDIT_SCHEMA_DESCRIPTION_TOPIC": "<br>Please note that messages on the topic <b>must</b> adhere to the <a href='https://github.com/cloudevents/spec/blob/v1.0/spec.md'><b>CloudEvents</b></a> format, and that this schema only describes the <b>contents</b> of the <code>data</code> property!",
    "INITIAL_SCHEMA_TEXT": "If you already have a <a href='https://json-schema.org/'>JSON Schema</a> for this topic, you can paste it here. Please note that messages on the topic <b>must</b> adhere to the <a href='https://github.com/cloudevents/spec/blob/v1.0/spec.md'><b>CloudEvents</b></a> format, and that this schema only describes the <b>contents</b> of the <code>data</code> property!",
    "INITIAL_SCHEMA_TEXT_DATA_TOPIC": "If you already have a <a href='https://json-schema.org/'> JSON schema </a> for this topic, you can insert it here. Please note that the schema may only be changed <b> consumer-compatible </b> later. This usually means that new fields can be added without any problems (if <code> additionalProperties </code> is set to <code>true</code>), but are difficult to remove again.",
    "EDIT_SCHEMA_DESCRIPTION_TOPIC_DATA": "Insert the new JSON schema for this topic here. Please note that the schema must be <b>consumer-compatible</b> with the previous schema (if there already was a schema). Most of the time, this means that you can add fields, but probably not remove them.",
    "Add Change Description": "Please explain the change in short.",
    "CHANGELOG_TOPIC_CREATED_HTML": "has created Topic <b><a href='{{ topicLink }}'>{{ topicName }}</a></b>.",
    "CHANGELOG_TOPIC_DELETED_HTML": "has deleted Topic <b>{{ topicName }}</b>.",
    "CHANGELOG_TOPIC_DESCRIPTION_CHANGE_HTML": "has updated the description of Topic <b><a href='{{ topicLink }}'>{{ topicName }}</a></b>.",
    "CHANGELOG_TOPIC_SUBSCRIBED_HTML": "has subscribed Application <b><a href='{{ appInfo.infoUrl }}'>{{ appInfo.name }}</a></b> to Topic <b><a href='{{ topicLink }}'>{{ topicName }}</a></b>.",
    "CHANGELOG_TOPIC_SUBSCRIBED_HTML_NO_APP_LINK": "has subscribed Application <b>{{ appInfo.name }}</b> to Topic <b><a href='{{ topicLink }}'>{{ topicName }}</a></b>.",
    "CHANGELOG_TOPIC_UNSUBSCRIBED_HTML": "has unsubscribed Application <b><a href='{{ appInfo.infoUrl }}'>{{ appInfo.name }}</a></b> from Topic <b><a href='{{ topicLink }}'>{{ topicName }}</a></b>.",
    "CHANGELOG_TOPIC_UNSUBSCRIBED_HTML_NO_APP_LINK": "has unsubscribed Application <b>{{ appInfo.name }}</b> from Topic <b><a href='{{ topicLink }}'>{{ topicName }}</a></b>.",
    "CHANGELOG_TOPIC_SCHEMA_VERSION_REGISTERED_HTML": "has published <b>a new JSON Schema</b> for Topic <b><a href='{{ topicLink }}'>{{ topicName }}</a></b>.",
    "TOPIC_ADVANCED_SETTINGS_HTML": "Here you can change Kafka-specific detail settings. These will be applied automatically to the target environment as well during staging. You can configure additional Kafka settings (e.g. Retention Time, Cleanup Policy) independently for each environment <b>after</b> creating the topic.",
    "TOPIC_CONFIG_HTML": "Here you can set technical Kafka configuration properties of your topic, separately for every environment your topic exists on. \"Default\" resets a field value to the cluster-side default value. If a field is set to the default value, it is filled with <i>green</i> color.",
    "TOPIC_CONFIG_WARNING_HTML": "Please note that many of these settings have <b>complex effects</b> and some setting values may lead to <b>unexpected loss of data</b>. Please do only change settings here if you are fully aware of resulting effects!",
    "TOPIC_CONFIG_UPDATE_SUCCESS": "The topic configuration has been updated successfully.",
    "TOPIC_CONFIG_UPDATE_ERROR": "The topic configuration could not be updated.",
    "TOPIC_CONFIG_TEXT": "Here you can set technical Kafka configuration properties of your topic, separately for every environment your topic exists on.",
    "ENV_APP_WARNING": "Please create a API Key for the application and the environment under ",
    "REMAINING_CHARACTERS_TEXT": "{{characters}} remaining characters",
    "NO_APPLICATIONS_USER_INFO": "You are currently not a Topic Administrator for any application. Request this for an application in the next box.",
    "ACL_TITLE_TEXT": "ACL doctor",
    "ACL_SUBTITLE_TEXT": "ACL analysis for Kafka environment",
    "ACL_INFO_TEXT": "No ACL differences present, or they're still loading...",
    "ACL_FIX_TEXT": "Correct the selected ones",
    "API_KEY_ALREADY_EXISTS_WARNING_HTML": "For this application a API Key has already been issued for the environment <b>{{ env }}</b>! If you continue here, the previous API Key <strong>loses</strong> its assigned Kafka permissions and becomes <strong>unusable</strong>.<br>(Existing permissions are transferred to the new API Key.).",
    "recommended_TEXT": "(recommended)",
    "KEY_BUTTON_TITLE": "Generate new API Key for environment {{env}}",
    "SUBSCRIPTION_APPROVAL_REQUIRED_INFO_HTML": "This topic requires an <b>approval</b> of subscriptions by the Topic Owner. If you subscribe to this topic, the Topic Owners will be informed and asked for their approval. You will be informed about their approval by e-mail.",
    "SECURITY_SETTINGS_HTML": "Here you can activate a special setting for topics with personal or sensitive data (even if sensitive data is only contained on later stages!). If you activate this setting, you will receive an e-mail notification about every subscription request for this topic. You can then either approve or reject that request. <br>Topics containing personal data <b>must</b> have this setting activated.",
    "REJECT_CONFIRM_DLG_HTML": "Caution! If you cancel this subscription, application <b>{{clientApplicationName}}</b> is no longer able to access this topic on the current environment. This can have negative impact of that application's operational level, up to a <b>complete breakdown</b>. Only do this if it is really required for <b>data security reasons</b>. Preferably ask the application team to cancel their subscription in an ordered way.<br><br>The application team will be informed about the cancellation of their subscription.",
    "UNSUBSCRIBE_CONFIRM_DLG_HTML": "Caution! If you cancel this subscription, application <b>{{clientApplicationName}}</b> is no longer able to access this topic on the current environment. This can have negative impact of that application's operational level, up to a <b>complete breakdown</b>. Only do this if your Application does not need to read from this topic anymore.",
    "SUBSCRIPTION_DESCRIPTION_LABEL": "Description (e.g. reason for usage)",
    "NO_API_KEY_FOR_APP": "No Api Key has been created yet for this application on this environment.",
    "SAVE_KEY_WARNING": "Please <b>save</b> the secret, before you close this dialogue! The secret will not be stored in Galapagos.",
    "APPLICATION_ENV_HINT_HTML": "This information is valid for current environment <b>{{ environmentName }}</b>.",
    "Cleanup Strategy": "Cleanup Strategy",
    "Log Compaction": "Log Compaction",
    "Deletion": "Deletion",
    "Compaction time": "Compaction time",
    "Retention time": "Retention time",
    "Normal": "Normal",
    "TOPIC_SETTINGS_INTRO_HTML": "Here you can make further settings for your topic. Based on this information, appropriate Kafka settings are made for your topic, which you can change later.",
    "CLEANUP_STRATEGY_TEXT_HTML": "Please select the so-called \"cleanup strategy\" for your topic here. \"Log Compaction\" ensures that <b>at least</b> the latest value is permanently available for each key in the topic. \"Deletion\" deletes data records on the topic when they have reached a certain age. <br> You can also <b>combine</b> both strategies so that data records are first \"compacted\", but then at some point also \"deleted\". <br>\n<a href=\"https://kafka.apache.org/documentation/#compaction\">Kafka Log Compaction Documentation</a>",
    "CRITICALITY_TEXT_HTML": "Please indicate here the criticality of the content of the topic that applies to the <b> production </b>. Even \"normal\" topics are already replicated (kept redundant on several brokers). \"Critical\" topics are <b> triple </b> redundant, so that there is even greater security in the event of failure of individual Kafka brokers.",
    "SIZE_ESTIMATION_TEXT_HTML": "Please estimate the amount and size of the expected data records on the topic (in <b> production </b>). This is currently <b> not </b> used to optimize the Kafka settings, but serves as an indicator for the company for any necessary capacity expansions."
}
